package org.example.lab_4;

/**
 * Класс, отвечающий за вывод различных меню в программе.
 */
public class Menu {

    /**
     * Выводит меню программы.
     */
    public static void printMenu() {
        System.out.println("""
                ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
                ┃                 Меню программы                  ┃
                ┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┫
                ┃ 1. Добавление нового велосипеда                 ┃
                ┃ 2. Вывод всех велосипедов из бд                 ┃
                ┃ 3. Редактирование велосипеда по id              ┃
                ┃ 4. Удаление велосипеда по id                    ┃
                ┃ 5. Поиск велосипедов с ценой, меньше введённой  ┃
                ┃ 6. Завершение работы программы                  ┃
                ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛""");
    }

    /**
     * Выводит меню параметров.
     */
    public static void printMenuChoiceConstructor() {
        System.out.println("""
                ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
                ┃ 1. Добавление без параметров ┃
                ┃ 2. Добавление с параметрами  ┃
                ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛""");
    }

    /**
     * Выводит предупреждения.
     *
     * @param menuChoice Выбор сообщения
     */
    public static void printMessage(MessageChoices menuChoice) {
        switch (menuChoice) {
            case BICYCLES_ARE_NOT_ADDED -> System.out.println("""
                    ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
                    ┃     Велосипеды ещё не добавлены      ┃
                    ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛""");
            case BIKE_IS_ADDED -> System.out.println("""
                    ┏━━━━━━━━━━━━━━━━━━━━━━┓
                    ┃  Велосипед добавлен  ┃
                    ┗━━━━━━━━━━━━━━━━━━━━━━┛""");
            case BIKE_IS_NOT_EXIST -> System.out.println("""
                    ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
                    ┃ Велосипеда с таким id нет ┃
                    ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━┛""");
        }
    }
}
